## WEEK 3--Wrangling Data: Preprocessing 
#### WEEK 3: FRIDAY LAB_02

In [76]:
import numpy as np
import pandas as pd 


#Reading in the Bank Marketing dataset. 
bank = pd.read_csv('https://raw.githubusercontent.com/mdfarhankhan196/Mohammed__IT533/master/data/bank-full.csv')
#Verifying that we can see the data
bank.head()

  age;"job";"marital";"education";"default";"balance";"housing";"loan";"contact";"day";"month";"duration";"campaign";"pdays";"previous";"poutcome";"y"
0  58;"management";"married";"tertiary";"no";2143...
1  44;"technician";"single";"secondary";"no";29;"...
2  33;"entrepreneur";"married";"secondary";"no";2...
3  47;"blue-collar";"married";"unknown";"no";1506...
4  33;"unknown";"single";"unknown";"no";1;"no";"n...

In [77]:
bank[['age', 'job', 'marital', 'education', 'default', 'balance', 'housing', 'loan', 'contact', 'day', 'month', 'duration', 'campaign', 'pdays', 'previous', 'poutcome', 'y']] = bank['age;"job";"marital";"education";"default";"balance";"housing";"loan";"contact";"day";"month";"duration";"campaign";"pdays";"previous";"poutcome";"y"'].str.split(';', expand = True)
bank = bank.drop(['age;"job";"marital";"education";"default";"balance";"housing";"loan";"contact";"day";"month";"duration";"campaign";"pdays";"previous";"poutcome";"y"'], axis = 1)

In [78]:
bank.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,58,"""management""","""married""","""tertiary""","""no""",2143,"""yes""","""no""","""unknown""",5,"""may""",261,1,-1,0,"""unknown""","""no"""
1,44,"""technician""","""single""","""secondary""","""no""",29,"""yes""","""no""","""unknown""",5,"""may""",151,1,-1,0,"""unknown""","""no"""
2,33,"""entrepreneur""","""married""","""secondary""","""no""",2,"""yes""","""yes""","""unknown""",5,"""may""",76,1,-1,0,"""unknown""","""no"""
3,47,"""blue-collar""","""married""","""unknown""","""no""",1506,"""yes""","""no""","""unknown""",5,"""may""",92,1,-1,0,"""unknown""","""no"""
4,33,"""unknown""","""single""","""unknown""","""no""",1,"""no""","""no""","""unknown""",5,"""may""",198,1,-1,0,"""unknown""","""no"""

                                                        #### Bank Marketing dataset Questions.

1. Data Transformation: Pick three variables whose data types may be more useful as another data type and u transform them to numeric or character/ categorical format.  Then, insert a text section into your notebook and explain in no less than 3 sentences what this transformation will allow you to accomplish analytically later on. (2 points)

In [79]:
bank.dtypes

age          object
job          object
marital      object
education    object
default      object
balance      object
housing      object
loan         object
contact      object
day          object
month        object
duration     object
campaign     object
pdays        object
previous     object
poutcome     object
y            object
dtype: object

In [80]:
bank['age'] = bank['age'].astype('int')

bank["balance"] = bank["balance"].astype('float')

bank["day"] = bank["day"].astype("int")

bank.dtypes[['age', 'balance', 'day']]

age          int32
balance    float64
day          int32
dtype: object

As illustrated from the above code the variables age, balance and day were transformed from string datatypes to interger, float and interger data types respectively. The data type enables for numerical computions as compared to string data types which would become a problem in analysis. The transformation enables for balance analysis through age and day.

2. Data Substitution: Substitute values in at least two variables. Insert a text section into your notebook and explain in no less than 3 sentences how you decided what values to use for substitution and, in addition to your explanation, show your code. (3 points)

In [82]:
bank.describe(include = ('O'))

,job,marital,education,default,housing,loan,contact,month,duration,campaign,pdays,previous,poutcome,y
count,45211,45211,45211,45211,45211,45211,45211,45211,45211,45211,45211,45211,45211,45211
unique,12,3,4,2,2,2,3,12,1573,48,559,41,4,2
top,"""blue-collar""","""married""","""secondary""","""no""","""yes""","""no""","""cellular""","""may""",124,1,-1,0,"""unknown""","""no"""
freq,9732,27214,23202,44396,25130,37967,29285,13766,188,17544,36954,36954,36959,39922

In [83]:
bank.poutcome.unique()

array(['"unknown"', '"failure"', '"other"', '"success"'], dtype=object)

In [84]:
bank.poutcome.replace('"unknown"', '"None"', inplace=True)

bank.poutcome.unique()

array(['"None"', '"failure"', '"other"', '"success"'], dtype=object)

In [85]:
bank.contact.unique()

array(['"unknown"', '"cellular"', '"telephone"'], dtype=object)

In [86]:
bank.contact.replace('"unknown"', '"Not provided"', inplace=True)

bank.contact.unique()

array(['"Not provided"', '"cellular"', '"telephone"'], dtype=object)

The poutcome and contact have been chosen as they had a value of unknown for their respective attributes. The variables are replaced with none for the poutcome which included failure, other and success. The contact was changed from unknown to Not provided. This Makes the dataset analysis to be carried out free from misinterpretation.

3. Data Reduction: Pick two variables that could be simplified by binning or bucketing, or by normalization or standardization. Then perform the operation(s) you have chosen. Insert a text section into your notebook and explain in no less than 3 sentences what benefit this may provide for any later analysis. (3 points)

In [87]:
bank.describe()

                age        balance           day
count  45211.000000   45211.000000  45211.000000
mean      40.936210    1362.272058     15.806419
std       10.618762    3044.765829      8.322476
min       18.000000   -8019.000000      1.000000
25%       33.000000      72.000000      8.000000
50%       39.000000     448.000000     16.000000
75%       48.000000    1428.000000     21.000000
max       95.000000  102127.000000     31.000000

In [88]:
bank.balance.describe()

count     45211.000000
mean       1362.272058
std        3044.765829
min       -8019.000000
25%          72.000000
50%         448.000000
75%        1428.000000
max      102127.000000
Name: balance, dtype: float64

In [89]:
balance_bins = np.linspace(bank.balance.min(),bank.balance.max(),4)
labels = ['low', 'medium', 'high']
bank0 = bank
bank0['balance_bins'] = pd.cut(bank0['balance'], bins=balance_bins, labels=labels, include_lowest=True)
bank0.groupby(['balance_bins']).count()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
balance_bins,,,,,,,,,,,,,,,,,
low,45147,45147,45147,45147,45147,45147,45147,45147,45147,45147,45147,45147,45147,45147,45147,45147,45147
medium,57,57,57,57,57,57,57,57,57,57,57,57,57,57,57,57,57
high,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7

In [90]:
bank.age.describe()

count    45211.000000
mean        40.936210
std         10.618762
min         18.000000
25%         33.000000
50%         39.000000
75%         48.000000
max         95.000000
Name: age, dtype: float64

In [91]:
age_bins = np.linspace(bank.age.min(),bank.age.max(),4)
labels = ['young', 'medium', 'old']
bank0 = bank
bank0['age_bins'] = pd.cut(bank0['age'], bins=age_bins, labels=labels, include_lowest=True)
bank0.groupby(['age_bins']).count()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y,balance_bins
age_bins,,,,,,,,,,,,,,,,,,
young,28411,28411,28411,28411,28411,28411,28411,28411,28411,28411,28411,28411,28411,28411,28411,28411,28411,28411
medium,16246,16246,16246,16246,16246,16246,16246,16246,16246,16246,16246,16246,16246,16246,16246,16246,16246,16246
old,554,554,554,554,554,554,554,554,554,554,554,554,554,554,554,554,554,554

Balance and Age variables have been chosen for the data reduction. The balance and age variables provides a glimpse to the relationship between age and balance among other bank marketing variables. The Balance bining will also be ideal in understanding the importance of housing in relation to balance.

4. Now that you have a better dataset, list TWO (2) important organizational analytical questions that management could ask about the dataset in order to help them make business or organizational decisions. (2 points)

1. Should people marry when they are young or older and what are the availabke housing in relation to balance?
2. Will a bank customer sign up for a long or short term deposit?